Tekla Open API Reference for Tekla Structures 2025
FacetedBrep Properties
The FacetedBrep type exposes the following members.
Properties
Name | Description
Faces
 Gets the faces.
GetEdges
 Gets the edges.
InnerWires
 Gets the inner wires.
OuterWires
 Gets the outer wires.
Vertices
 Gets the vertices.
Top
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace